tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        }
    }
}

static void prvCliTask_TCP( void *pvParameters )
{
    uint32_t ulResponseLength;
    struct freertos_sockaddr xClient, xBindAddress;
    socklen_t xSize = sizeof( xClient );
    BaseType_t xCount, xResponseRemaining, xResponseSent;
    Socket_t xListeningSocket = FREERTOS_INVALID_SOCKET, xConnectedSocket = FREERTOS_INVALID_SOCKET;
    struct freertos_sockaddr xSourceAddress, xServerAddress;
    socklen_t xSourceAddressLength = sizeof( xSourceAddress );
    TickType_t xCLIServerRecvTimeout = portMAX_DELAY;
    static const TickType_t xCLIServerSendTimeout = pdMS_TO_TICKS( 4000 );
    char * pcOutputBuffer = FreeRTOS_CLIGetOutputBuffer();
    const BaseType_t xBacklog = 20;

    ( void ) pvParameters;

    xListeningSocket = FreeRTOS_socket( FREERTOS_AF_INET,
                                        FREERTOS_SOCK_STREAM,
                                        FREERTOS_IPPROTO_TCP );
    configASSERT( xListeningSocket != FREERTOS_INVALID_SOCKET );

    /* No need to return from FreeRTOS_recvfrom until a message
     * is received. */
    FreeRTOS_setsockopt( xListeningSocket,
                         0,
                         FREERTOS_SO_RCVTIMEO,
                         &( xCLIServerRecvTimeout ),
                         sizeof( TickType_t ) );

    xServerAddress.sin_port = FreeRTOS_htons( configCLI_SERVER_PORT );

    #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
        xServerAddress.sin_address.ulIP_IPv4 = FreeRTOS_GetIPAddress();
    #else
        xServerAddress.sin_addr = FreeRTOS_GetIPAddress();
    #endif

    FreeRTOS_bind( xListeningSocket, &( xServerAddress ), sizeof( xServerAddress ) );

    /* start listening */
    FreeRTOS_listen( xListeningSocket, xBacklog );

	for( ;; )
	{
		/* Wait for a client to connect. */
		xConnectedSocket = FreeRTOS_accept( xListeningSocket, &xClient, &xSize );
		configASSERT( xConnectedSocket != FREERTOS_INVALID_SOCKET );

		/* Spawn a task to handle the connection. */
		xTaskCreate( TCP_Server_Task, "CLI TCP Server Instance", mainCLI_TASK_STACK_SIZE, ( void * ) xConnectedSocket, mainCLI_TASK_PRIORITY, NULL );
	}

}

static void TCP_Server_Task(void *pvParams)
{

    uint32_t ulResponseLength;
    BaseType_t xCount, xResponseRemaining, xResponseSent;
    Socket_t xCLIServerSocket = (Socket_t) pvParams;
    struct freertos_sockaddr xSourceAddress, xServerAddress;
    socklen_t xSourceAddressLength = sizeof( xSourceAddress );
    char * pcOutputBuffer = FreeRTOS_CLIGetOutputBuffer();
    const BaseType_t xBacklog = 20;
    static const TickType_t xReceiveTimeOut = pdMS_TO_TICKS( 5000 );
    static const TickType_t xSendTimeOut = pdMS_TO_TICKS( 5000 );
    uint8_t *pucRxBuffer = NULL;

	/* Attempt to create the buffer used to receive the string to be echoed
	back.  This could be avoided using a zero copy interface that just returned
	the same buffer. */
	pucRxBuffer = ( uint8_t * ) pvPortMalloc( ipconfigTCP_MSS );
    configASSERT(pucRxBuffer != NULL);

    FreeRTOS_setsockopt( xCLIServerSocket, 0, FREERTOS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
    FreeRTOS_setsockopt( xCLIServerSocket, 0, FREERTOS_SO_SNDTIMEO, &xSendTimeOut, sizeof( xReceiveTimeOut ) );
    
    for( ;; )
    {

        /* Zero out the receive array so there is NULL at the end of the string
        when it is printed out. */
        memset( pucRxBuffer, 0x00, ipconfigTCP_MSS );

        uint8_t ucRequestId[ 4 ];

#if USE_TCP_ZERO_COPY


#else

            xCount = FreeRTOS_recv( xCLIServerSocket, pucRxBuffer, ipconfigTCP_MSS, 0 );

#endif /* USE_TCP_ZERO_COPY */

        /* Since we set the receive timeout to portMAX_DELAY, the
         * above call should only return when a command is received. */
        //configASSERT( xCount > 0 );

        if( xCount > 0 )
        {
            configASSERT( xCount < configMAX_COMMAND_INPUT_SIZE);

            memcpy(cInputCommandString, pucRxBuffer, xCount);
            cInputCommandString[ xCount ] = '\0';

            //prvSendResponseBytes_TCP(xCLIServerSocket, cInputCommandString, xCount + 1);

#if 1
            if( prvIsValidRequest( ( const uint8_t * ) &( cInputCommandString[ 0 ] ), xCount, &( ucRequestId[ 0 ] ) ) == pdTRUE )
            {
                uint8_t ucPacketNumber = 1;
#ifdef TIM7_TEST
                extern uint32_t tim7_period;

                #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                #else
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s TIM7 period ms: %u \n", xSourceAddress.sin_addr,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ), tim7_period ) );
                #endif

#else

                #if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_address.ulIP_IPv4,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
                #else
                    configPRINTF( ( "Received command. IP:%x Port:%u Content:%s \n", xSourceAddress.sin_addr,
                                                                                    xSourceAddress.sin_port,
                                                                                    &( cInputCommandString[ PACKET_HEADER_LENGTH ] ) ) );
                #endif

#endif
                do
                {
                    /* Send the received command to the FreeRTOS+CLI. */
                    xResponseRemaining = FreeRTOS_CLIProcessCommand( &( cInputCommandString[ PACKET_HEADER_LENGTH ] ),
                                                                        pcOutputBuffer,
                                                                        configCOMMAND_INT_MAX_OUTPUT_SIZE - 1 );

