tony-josi-aws/STM32F439ZI_FreeRTOS_TCP_CLI/Lib/FreeRTOS-Plus-CLI/app_main.c
        memcpy( &( ucUdpResponseBuffer[ 0 ] ),
                &( header ),
                PACKET_HEADER_LENGTH );

        /* Write actual response to the buffer. */
        memcpy( &( ucUdpResponseBuffer[ PACKET_HEADER_LENGTH] ),
                &( pucResponse[ ulBytesSent ] ),
                ulBytesToSend );



#if USE_TCP_ZERO_COPY

#else

            /* Send response. */

            lBytes = ulBytesToSend + PACKET_HEADER_LENGTH;
            lSent = 0;
            lTotalSent = 0;

            /* Call send() until all the data has been sent. */
            while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
            {
                lSent = FreeRTOS_send( xCLIServerSocket, ucUdpResponseBuffer, lBytes - lTotalSent, 0 );
                lTotalSent += lSent;
            }

            if( lSent < 0 )
            {
                /* Socket closed? */
                break;
            }

#endif /* USE_ZERO_COPY */

        if( lSent != ( ulBytesToSend + PACKET_HEADER_LENGTH ) )
        {
            configPRINTF( ("[ERROR] Failed to send response.\n" ) );
            ret = pdFAIL;
            break;
        }

        ulRemainingBytes -= (lTotalSent - PACKET_HEADER_LENGTH);
    }

    return ret;
}

static BaseType_t prvSendResponseBytes_TCP( Socket_t xCLIServerSocket,
                                          const uint8_t * pucResponse,
                                          uint32_t ulResponseLength )
{
    BaseType_t ret = pdPASS;
    int32_t lBytes, lSent, lTotalSent;

    lBytes = ulResponseLength;
    lSent = 0;
    lTotalSent = 0;

    /* Call send() until all the data has been sent. */
    while( ( lSent >= 0 ) && ( lTotalSent < lBytes ) )
    {
        lSent = FreeRTOS_send( xCLIServerSocket, pucResponse, lBytes - lTotalSent, 0 );
        lTotalSent += lSent;
    }

    if( lSent < 0 )
    {
        /* Socket closed? */
        ret = pdFAIL;
    }
    
    return ret;

}
/*-----------------------------------------------------------*/

uint32_t ulApplicationGetNextSequenceNumber( uint32_t ulSourceAddress,
                                             uint16_t usSourcePort,
                                             uint32_t ulDestinationAddress,
                                             uint16_t usDestinationPort )
{
    uint32_t ulReturn;

    ( void ) ulSourceAddress;
    ( void ) usSourcePort;
    ( void ) ulDestinationAddress;
    ( void ) usDestinationPort;

    xApplicationGetRandomNumber( &ulReturn );

    return ulReturn;
}
/*-----------------------------------------------------------*/

static void network_up_status_thread_fn(void *io_params) {
	while(1) {
		if (network_up == 0)
		{
			ulTaskNotifyTake( pdTRUE, portMAX_DELAY );
		}

		for (int i = 0; i < 4; ++i)
		{
			HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_7);
			vTaskDelay(50);
		}
		vTaskDelay(200);
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);
		vTaskDelay(20);
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_14);
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);
	}
}

#if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
	void vApplicationIPNetworkEventHook_Multi( eIPCallbackEvent_t eNetworkEvent, struct xNetworkEndPoint* pxEndPoint )
#else
	void vApplicationIPNetworkEventHook( eIPCallbackEvent_t eNetworkEvent)
#endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
{
    /* If the network has just come up...*/
    if( eNetworkEvent == eNetworkUp )
    {
    uint32_t ulIPAddress, ulNetMask, ulGatewayAddress, ulDNSServerAddress;
    char cBuffer[ 16 ];

        /* Create the tasks that use the IP stack if they have not already been
         * created. */
        if( xTasksAlreadyCreated == pdFALSE )
        {
            xTasksAlreadyCreated = pdTRUE;

#if USE_UDP
            /* Sockets, and tasks that use the TCP/IP stack can be created here. */
            xTaskCreate( prvCliTask,
                         "cli",
                         mainCLI_TASK_STACK_SIZE,
                         NULL,
                         mainCLI_TASK_PRIORITY,
                         NULL );
#endif

#if USE_TCP

            /* Sockets, and tasks that use the TCP/IP stack can be created here. */
            xTaskCreate( prvCliTask_TCP,
                         "cli",
                         mainCLI_TASK_STACK_SIZE,
                         NULL,
                         mainCLI_TASK_PRIORITY,
                         NULL );
#endif

        }

        /* Print out the network configuration, which may have come from a DHCP
         * server. */
        FreeRTOS_GetEndPointConfiguration( &ulIPAddress, &ulNetMask, &ulGatewayAddress, &ulDNSServerAddress, pxNetworkEndPoints );
        FreeRTOS_inet_ntoa( ulIPAddress, cBuffer );
        configPRINTF( ( "IP Address: %s\n", cBuffer ) );

        FreeRTOS_inet_ntoa( ulNetMask, cBuffer );
        configPRINTF( ( "Subnet Mask: %s\n", cBuffer ) );

        FreeRTOS_inet_ntoa( ulGatewayAddress, cBuffer );
        configPRINTF( ( "Gateway Address: %s\n", cBuffer ) );

        FreeRTOS_inet_ntoa( ulDNSServerAddress, cBuffer );
        configPRINTF( ( "DNS Server Address: %s\n", cBuffer ) );

        network_up = 1;
        xTaskNotifyGive( network_up_task_handle );

    }
    else if( eNetworkEvent == eNetworkDown )
    {
    	network_up = 0;
    }
}
/*-----------------------------------------------------------*/

#if ( ipconfigUSE_LLMNR != 0 ) || ( ipconfigUSE_NBNS != 0 )

#if defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 )
	BaseType_t xApplicationDNSQueryHook_Multi( struct xNetworkEndPoint * pxEndPoint, const char * pcName )
#else
	BaseType_t xApplicationDNSQueryHook( const char * pcName )
#endif /* defined(ipconfigIPv4_BACKWARD_COMPATIBLE) && ( ipconfigIPv4_BACKWARD_COMPATIBLE == 0 ) */
{
    BaseType_t xReturn = pdFAIL;

    /* Determine if a name lookup is for this node.  Two names are given
     * to this node: that returned by pcApplicationHostnameHook() and that set
     * by mainDEVICE_NICK_NAME. */
    if( strcasecmp( pcName, pcApplicationHostnameHook() ) == 0 )
    {
        xReturn = pdPASS;
    }
    return xReturn;
}

#endif /* ( ipconfigUSE_LLMNR != 0 ) || ( ipconfigUSE_NBNS != 0 ) */

/*-----------------------------------------------------------*/

